//----------------------------------------------------------------------------------------------------------------------
///
/// \file       searchparam.hpp
/// \brief      Параметр поиска max/min
/// \details    Вынесено отдельно от реализации методов решения задачи о назначениях
/// \addtogroup spm
/// \{
///

#pragma once

namespace SPM /// Специальная библиотека программных модулей (СБПМ)
{
namespace LAP /// Решение задачи о назначениях
{
///
/// \brief Критерий поиска - минимум/максимум для задачи о назначениях
///
enum TSearchParam
{
    SP_Min,
    SP_Max
};

} // namespace LAP
} // namespace SPM
/// \}
